[
    {
        "name": "Neurology",
        "description": "Neurology deals with the diagnosis and treatment of all categories of conditions and disease involving the central and peripheral nervous systems"
    },
    {
        "name": "Orthopaedic",
        "description": "Relating to the branch of medicine dealing with the correction of deformities of bones or muscles."
    },
    {
        "name": "Dermatology",
        "description": "Branch of medicine dealing with the skin."
    },
    {
        "name": "Internal medicine",
        "description": "The medical specialty dealing with the prevention, diagnosis, and treatment of adult diseases."
    },
    {
        "name": "Gastroenterology",
        "description": "Branch of medicine focused on the digestive system and its disorders."
    },
    {
        "name": "Rheumatology",
        "description": "Branch of medicine devoted to the diagnosis and therapy of rheumatic diseases."
    },
    {
        "name": "Hepatology",
        "description": "Branch of medicine that incorporates the study of liver, gallbladder, biliary tree, and pancreas as well as management of their disorders."
    },
    {
        "name": "Hematology",
        "description": "Branch of medicine concerned with the study of the cause, prognosis, treatment, and prevention of diseases related to blood."
    },
    {
        "name": "Cardiology",
        "description": "Branch of medicine that deals with the disorders of the heart as well as some parts of the circulatory system."
    },
    {
        "name": "Angiology",
        "description": "Medical specialty which studies the diseases of the circulatory system and of the lymphatic system, i.e., arteries, veins and lymphatic vessels, and its diseases."
    },
    {
        "name": "Oncology",
        "description": "Branch of medicine that deals with the prevention, diagnosis, and treatment of cancer."
    },
    {
        "name": "Pulmonology",
        "description": "Medical specialty that deals with diseases involving the respiratory tract.[1] It is also known as respirology, respiratory medicine, or chest medicine in some countries and areas."
    }

]